import pandas as pd
from collections import deque
workLists = [['공사', '20201107565-00', 'http://www.g2b.go.kr:8081/ep/invitation/publish/bidInfoDtl.do?bidno=20201107565&bidseq=00&releaseYn=Y&taskClCd=3', '일반', '횡성군 민원실 광장 개선공사', 'http://www.g2b.go.kr:8081/ep/invitation/publish/bidInfoDtl.do?bidno=20201107565&bidseq=00&releaseYn=Y&taskClCd=3', '강원도 횡성군', '강원도 횡성군', '수의(소액)-견적입찰(2인 이상 견적 제출)', '2020/11/06 17:37\n(2020/11/12 12:00)', '', '마감'], ['공사', '20200924782-00', 'http://www.g2b.go.kr:8081/ep/invitation/publish/bidInfoDtl.do?bidno=20200924782&bidseq=00&releaseYn=Y&taskClCd=3', '일반', '강원도 명품길(횡성호수길) 조성사업', 'http://www.g2b.go.kr:8081/ep/invitation/publish/bidInfoDtl.do?bidno=20200924782&bidseq=00&releaseYn=Y&taskClCd=3', '강원도 횡성군', '강원도 횡성군', '수의(소액)-견적입찰(2인 이상 견적 제출)', '2020/09/23 17:12\n(2020/09/29 12:00)', '', '마감']]
bidLists = [[['1', '2248140683', '주식회사 이원', '이복균', '42,638,610', '87.918', '03 02', '2020/11/11 19:56:31', ' '], ['2', '8858601802', '주식회사 으뜸', '조은주', '42,650,000', '87.941', '11 12', '2020/11/11 22:15:59', ' '], ['', '2268129063', '(주) 공간과풍경', '김재덕', '42,340,000', '87.302', '15 08', '2020/11/11 15:08:56', '낙찰하한선 미달'], ['', '2248125339', '주식회사 송산', '김현숙', '42,468,690', '87.568', '07 11', '2020/11/11 13:40:00', '낙찰하한선 미달'], ['', '3728701851', '주식회사 호수', '이숙', '42,470,000', '87.570', '12 04', '2020/11/11 22:32:31', '낙찰하한선 미달']], [['1', '3728701851', '주식회사 호수', '이숙', '46,293,000', '98.908', '04 06', '2020/09/28 17:22:22', ' '], ['', '2268129063', '(주) 공간과풍경', '김재덕', '41,005,700', '87.611', '02 01', '2020/09/28 18:55:12', '낙찰하한선 미달'], ['', '2248125339', '주식회사 송산', '김현숙', '41,051,490', '87.709', '14 07', '2020/09/27 13:34:01', '낙찰하한선 미달'], ['', '2248140683', '주식회사 이원', '이복균', '41,066,000', '87.740', '14 12', '2020/09/28 21:39:37', '낙찰하한선 미달']]]

#df = pd.DataFrame(Lists)


df = pd.DataFrame(columns=['공고번호-차수', '순위', '사업자 등록번호', '업체명', '대표자명', '입찰금액(원)', '투찰률(%)', '추첨 번호', '투찰일시', '비고'])
count = 0
for idx in range(len(bidLists)):
    for j in bidLists[idx]:
        kk = deque(j)
        kk.appendleft(workLists[idx][1])
        df.loc[count] = list(kk)

        count += 1
#df['두번째 입찰!'] = Lists[1]
print(df)